
Buttons_Dict = {'Цилиндрическая с внешним зацеплением:':
                    [None, {'Геометричекский расчёт': None}],

                'Коническая с внешними зубьями:':
                    [None, {'Геометричекский расчёт': None}]
                }

# Buttons_Dict = {'Цилиндрическая с внешним зацеплением:':
#                     [None, {'Геометричекский расчёт': None,
#                             'Прочностной расчёт': None}],
#
#                 'Коническая с внешними зубьями:':
#                     [None, {'Геометричекский расчёт': None,
#                             'Прочностной расчёт': None}],
#
#                 'Червячная с цилиндрическим червяком:':
#                     [None, {'Геометричекский расчёт': None}]
#                 }